# HR ANALYTICS

Importing Libraries

In [1]:
import numpy as np
import pandas as pd

Loading the data

In [2]:
data = pd.read_csv("chat_groups.csv")
data = pd.read_csv("employee_attrition.csv")
data = pd.read_csv("employee_course_ratings.csv")

In [3]:
data.head(10)

,EmployeeID,EmpName,CourseID,CourseName,Rating
0,1408,Ignace Ormonde,14,Video Production,3
1,1249,Gabriela Balcon,17,Translation,2
2,1158,Enrique Lewer,8,IT Architecture,3
3,1564,Wallie Byrd,18,Natural Language Processing,3
4,1334,Hannah Ganter,6,Java Programming,4
5,1713,Josefa Skatcher,17,Translation,3
6,1499,Theobald Crosston,13,UX Design,1
7,1090,Delmer Chiplen,21,Social Media Marketing,1
8,1839,Adeline Diwell,12,People Management,1
9,1119,Annamarie Powderham,16,Audio Production,3

In [4]:
data.shape

(1000, 5)

In [5]:
data.describe()

        EmployeeID     CourseID       Rating
count  1000.000000  1000.000000  1000.000000
mean   1498.523000    12.837000     2.771000
std     288.933065     7.261485     1.341028
min    1001.000000     1.000000     0.000000
25%    1250.750000     6.000000     2.000000
50%    1503.500000    13.000000     3.000000
75%    1740.500000    19.000000     4.000000
max    1999.000000    25.000000     5.000000

Looking for missing values

In [6]:
data.isnull().sum()

EmployeeID    0
EmpName       0
CourseID      0
CourseName    0
Rating        0
dtype: int64

Creating another dataframe for Visualization

In [7]:
arj_dummies = pd.get_dummies("EmployeeID")

Importing libraries

In [8]:
import seaborn as sns
import matplotlib.pyplot as plt

In [9]:
sns.set_theme(style="darkgrid")

In [10]:
data.count()

EmployeeID    1000
EmpName       1000
CourseID      1000
CourseName    1000
Rating        1000
dtype: int64

In [11]:
data.select_dtypes

<bound method DataFrame.select_dtypes of      EmployeeID            EmpName  CourseID                   CourseName  \
0          1408     Ignace Ormonde        14             Video Production
1          1249    Gabriela Balcon        17                  Translation
2          1158      Enrique Lewer         8              IT Architecture
3          1564        Wallie Byrd        18  Natural Language Processing
4          1334      Hannah Ganter         6             Java Programming
..          ...                ...       ...                          ...
995        1784  Ambrosio Pucknell         1               Cyber Security
996        1321   Carma Gherardini        10           Mobile Development
997        1067        Colan Keese         6             Java Programming
998        1053        Nikos Hosby        18  Natural Language Processing
999        1671        Valene Buie        21       Social Media Marketing

     Rating
0         3
1         2
2         3
3         3
4         4
..      ...
995       1
996       2
997       4
998       2
999       5

[1000 rows x 5 columns]>